app/views/shared/_category_display.html.erb

<% post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 1]]