app/views/posts/index.html.erb

      <ul>
        <% post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 1]]