app/controllers/posts_controller.rb

  def index
    @title = "All Posts"
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new(params_post)
    @post.user_id = 1

    if @post.save
---
INSERT INTO "posts" ("title", "url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Huffington Post"], ["url", "http://www.huffingtonpost.com"], ["description", ""], ["created_at", "2015-05-29 19:56:52.835611"], ["updated_at", "2015-05-29 19:56:52.835611"]]

  def update
    if @post.update(params_post)
---
UPDATE "posts" SET "url" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["url", "https://www.espn.go.com"], ["updated_at", "2015-05-29 19:51:30.915258"], ["id", 1]]